{
	"fvtt-perf-optim": {
		"settings": {
			"optimize-interface-layer-clipping": {
				"name": "Optimiere Render-Reihenfolge von Token UI-Elementen",
				"hint": "Optimiert, in welcher Reihenfolge die Token UI Elemente gerendert werden für verbessertes Draw Call Batching. Keine optische Beeinflussung der Tokens zu erwarten. Wird benötigt, damit die anderen Einstellungen einen merkbaren Einfluss haben."
			},
			"token-bars-caching": {
				"name": "Token-Ressourceleisten cachen",
				"hint": "Cacht die Token-Ressourcenleisten, um Draw Batching zu verbessern. Kann auf hohen Zoomstufen geringe negative Auswirkung auf die Qualität haben."
			},
			"token-effects-caching": {
				"name": "Token-Effekte cachen",
				"hint": "Cacht die Token-Effektleiste. Kann auf hohen Zoomstufen geringe negative Auswirkung auf die Qualität haben."
			},

			"spritesheet-substitution": {
				"name": "Austausch von Texturen mit Spritesheets",
				"hint": "Tauscht gewisse Icons und andere Grafikelemente von Foundry gegen Spritesheets aus. Dies kann die Leistung und den Ressourcenverbrauch bei der Anzeige von vielen UI Icons für Journals, Lichter, Türen etc. verbessern."
			},
			"spritesheet-substitution-custom": {
				"name": "Eigene Spritesheets",
				"label": "Verwalte eigene Spritesheets",
				"hint": "Eigene Spritesheets können verwendet werden, um Grafiken von Effekten, Tiles, Tokens, Szenen und anderen Objekten auszutauschen.",
				"menu": {
					"add": "Eigenes Spritesheet hinzufügen",
					"spritesheet": "Wähle Spritesheet aus",
					"delete": "Lösche Spritesheet",
					"title": "Verwalte eigene Spritesheets",
					"warn-no-src": "Du musst einen Spritesheet-Pfad auswählen, um ihn hinzuzufügen",
					"warn-no-json": "Die ausgewählte Datei muss eine gültige pixi.js Spritesheet JSON-Datei sein",
					"warn-invalid-asset": "Die ausgewählte Datei enthält keine gültigen pixi.js Spritesheet-Daten",
					"warn-init-failed": "Prime Performance: Fehler beim Laden der Standard-Spritesheets. Optimierung durch Spritesheets wird deaktiviert. Bitte prüfe die Konsole auf weitere Details.",
					"warn-custom-spritesheets-failed": "Prime Performance: Fehler beim Laden von einem oder mehreren eigenen Spritesheets. Bitte prüfe die Konsole auf weitere Details."
				}
			},
			"token-ring-spritesheet-support": {
				"name": "Unterstützung für Spritesheets im dynamischen Token-Ring",
				"hint": "Erlaubt es, Token-Grafiken mit dynamischen Ringen durch Spritesheet-Texturen zu ersetzen. Dies ist nur nötig, wenn du dynamische Token-Ringe und den Austausch von Spritesheets verwendest, um Token-Grafiken (subject textures) auszutauschen."
			},
			"precomputed-noise-textures": {
				"name": "Optimierte animierte Lichter",
				"hint": "Optimiert den Shader von animierten Lichtern (Bewitching Wave, Fairy Light, Ghostly Light, Smoke Patch, Swirling Fog, Vortex) indem vorberechnete Texturen für das FBM Rauschen verwendet werden."
			},
			"reduce-lighting-resolution": {
				"name": "Auflösung der Lichteffekte reduzieren",
				"hint": "Reduziert die interne Auflösung von Lichteffekten. Verbessert die Performance deutlich, insbesondere wenn viele Lichteffekte oder große Lichtquellen verwendet werden. Die visuelle Beeinträchtigung sollte minimal sein. Die Skalierung für die einzelnen Beleuchtungsebenen kann im separaten Menü konfiguriert werden."
			},
			"disable-app-v2-background-blur": {
				"name": "Hintergrund-Blur deaktivieren",
				"hint": "Deaktiviert die Hintergrund-Blur in App V2 und allen anderen UI-Elementen. Dies kann die Leistung dramatisch verbessern, insbesondere auf schwächeren GPUs und bestimmten Betriebssystemen wie MacOS."
			},

			"custom-render-scale": {
				"name": "Skalierung der Lichteffekte",
				"label": "Skalierung konfigurieren",
				"hint": "Konfiguriere die interne Auflösung für Lichteffekte auf dem Spielfeld. Dies kann die Leistung deutlich verbessern, besonders auf schwächeren GPUs. Die visuelle Auswirkung reicht von unbemerkbar bis sehr auffällig, abhängig von der Effektebene. Aktiviere \"Auflösung der Lichteffekte reduzieren\", damit diese Konfiguration wirksam wird.",
				"menu": {
					"title": "Benutzerdefinierte Skalierung",
					"label": "Benutzerdefinierte Skalierung",
					"description": "Konfiguriere die Skalierung für die individuellen Ebenen der Lichteffekte. Die Darstellungsskalierung ist der Prozentwert für die interne Auflösung der Lichteffekte. Ein Wert von 100 bedeutet 100% Darstellungsskalierung, also keine Änderung. Ein Wert von 50 bedeutet, dass die Auflösung halbiert (und die Menge der zu berechnenden Pixel geviertelt) wird, usw.",
					"confirm": "Bestätigen",
					"cancel": "Zurücksetzen",
					"FIELDS": {
						"background": {
							"label": "Hintergrund",
							"hint": "Darstellungsskalierung für Hintergrundeffekte. Hohe visuelle Auswirkung, minimale Leistungsverbesserung. Optimierter Standardwert ist 100%."
						},
						"illumination": {
							"label": "Beleuchtung",
							"hint": "Darstellungsskalierung für die Beleuchtungsebene. Sehr geringe visuelle Auswirkung, mittlere Leistungsverbesserung. Optimierter Standardwert ist 40%."
						},
						"coloration": {
							"label": "Färbung",
							"hint": "Darstellungsskalierung für Färbungsebene. Mittlere bis sehr hohe visuelle Auswirkung, abhängig von der gewählten Färbungsmethode. Hohe Leistungsverbesserung. Optimierter Standardwert ist 100%."
						},
						"darkness": {
							"label": "Dunkelheit",
							"hint": "Darstellungsskalierung für Dunkelheitseffekte. Minimale visuelle Auswirkung, minimale Leistungsverbesserung. Optimierter Standardwert ist 50%."
						}
					}
				}
			}
		}
	}
}
