{
	"fvtt-perf-optim": {
		"settings": {
			"optimize-interface-layer-clipping": {
				"name": "Optimiere Render-Reihenfolge von Token UI-Elementen",
				"hint": "Optimiert, in welcher Reihenfolge die Token UI Elemente gerendert werden für verbessertes Draw Call Batching. Keine optimische Beeinflussung der Tokens zu erwarten. Wird benötigt, damit die anderen Einstellunge einen merkbaren Einfluss haben."
			},
			"token-bars-caching": {
				"name": "Token-Ressourceleisten cachen",
				"hint": "Cacht die Token-Ressourcenleisten Draw Batching zu verbessern. Kann auf hohen Zoomstufen geringe negative Auswirkung auf die Qualität der haben."
			},
			"token-effects-caching": {
				"name": "Token-Efekte cachen",
				"hint": "Cacht die Token-Effektleiste. Kann auf hohen Zoomstufen geringe negative Auswirkung auf die Qualität haben."
			},
			"spritesheet-substitution": {
				"name": "Austausch von Texturen mit Spritesheets",
				"hint": "Tauscht gewisse Icons und andere Grafikelemente von Foundry gegen Spritesheets aus. Dies kann die Leistung und den Resourcenverbrauch bei der Anzeige von vielen UI Icons für Journals, Lichter, Türen etc verbessern."
			},
			"spritesheet-substitution-custom": {
				"name": "Eigene Spritesheets",
				"label": "Verwalte eigene Spritesheets",
				"hint": "Eigene Spritesheets können verwendet werden, um Grafiken von Effekten, Tiles, Tokens, Szenen und anderen Objekten auszutauschen.",
				"menu": {
					"add": "Eigenes Spritesheet hinzufügen",
					"spritesheet": "Wähle Spritesheet aus",
					"delete": "Lösche Spritesheet",
					"title": "Verwalte eigene Spritesheets",
					"warn-no-src": "Du musst einen Spritesheet-Pfad auswählen, um ihn hinzuzufügen",
					"warn-no-json": "Die ausgewählte Datei muss eine gültige pixi.js Spritesheet JSON-Datei sein",
					"warn-inalid-asset": "Die ausgewählte Datei enthält keine gültigen pixi.js Spritesheet-Daten",
					"warn-init-failed": "Prime Performance: Fehler beim laden der Standard-Spritesheets. Optimierung durch Spritesheets wird deaktiviert. Bitte prüfe die Konsole auf weitere Details.",
					"warn-custom-spritesheets-failed": "Prime Performance: Fehler beim laden von einen oder mehreren eigenen Spritesheets. Bitte prüfe die Konsole auf weitere Details."
				}
			},
			"token-ring-spritesheet-support": {
				"name": "Unterstützung für Spritesheets im dynamischen Token-Ring",
				"hint": "Erlaubt es, Token-Grafiken mit dynamischen Ringen durch Spritesheet-Texturen zu ersetzen. Dies ist nur nötig, wenn du dynamische Token-Ringe und den Austausch von Spritesheets verwendest, um Token-Grafiken (subject textures) auszutauschen."
			},
			"precomputed-noise-textures": {
				"name": "Optimierte animierte Lichter",
				"hint": "Optimiert den Shader von animierten Lichtern (Bewitching Wave, Fairy Light, Ghostly Light, Smoke Patch, Swirling Fog, Vortex) indem vorberechnete Texturen für das FBM Rauschen verwendet werden."
			}
		}
	}
}
