{
	"fvtt-perf-optim": {
		"settings": {
			"optimize-interface-layer-clipping": {
				"name": "Optimize Token UI Render Batching",
				"hint": "Optimizes render batching of Token UI elements. No visual degradation expected. Required in order for the token bars and effects caching settings to have a noticeable impact."
			},
			"token-bars-caching": {
				"name": "Cache Token Resource Bars",
				"hint": "Caches token resource bars to textures. Very minor visual degradation on high zoom levels expected."
			},
			"token-effects-caching": {
				"name": "Cache Token Effects",
				"hint": "Caches the token effects bar. Very minor visual degradation on high zoom levels expected."
			},
			"precomputed-noise-textures": {
				"name": "Optimize animated lights",
				"hint": "Optimizes the shader of certain animated lights (Bewitching Wave, Fairy Light, Ghostly Light, Smoke Patch, Swirling Fog, Vortex) by utilizing precomputed FBM noise textures. The visual impact is minimal, but the performance impact is significant, especially on lower-end GPUs."
			},
			"reduce-lighting-resolution": {
				"name": "Scale Lighting Effects Resolution",
				"hint": "Reduces the internal resolution of lighting effects to improve performance. This can dramatically improve performance, especially when using many lights or large light sources. The visual impact should be minimal, except for some very high zoom levels and some lighting effects like hexa dome that have very clear outlines. You can configure the render scale for the individual lighting layers in the settings menu."
			},
			"spritesheet-substitution": {
				"name": "Texture Replacement with Spritesheets",
				"hint": "Substitutes core SVG icons and other graphic elements with optimized spritesheets. This can improve performance and resource usage when displaying many UI icons for journals, lights, doors, etc."
			},
			"spritesheet-substitution-custom": {
				"name": "Custom Spritesheets",
				"label": "Manage Custom Spritesheets",
				"hint": "Custom spritesheets can be used to replace more core or custom Icons and textures, for example custom condition marker, token art or tiles for improved performance",
				"menu": {
					"add": "Add Custom Spritesheet",
					"spritesheet": "Select Custom Spritesheet",
					"delete": "Delete Custom Spritesheet",
					"title": "Manage Custom Spritesheets",
					"warn-no-src": "You must select a spritesheet source to add it",
					"warn-no-json": "The file you select must be a valid pixi.js spritesheet JSON file",
					"warn-inalid-asset": "The file you select does not contain valid pixi.js spritesheet data",
					"warn-init-failed": "Prime Performance: Failed to load default icon substitution spritesheets. Spritesheet optimizations will be disabled. Please check the console for more details.",
					"warn-custom-spritesheets-failed": "Prime Performance: Failed to load one or more custom spritesheet. Please check the console for more details."
				}
			},
			"token-ring-spritesheet-support": {
				"name": "Dynamic Token Spritesheet Support",
				"hint": "Allows tokens with dynamic rings to be replaced with spritesheet textures. This is only needed if you use dynamic token rings and the spritesheet substitution feature to replace token textures."
			},
			"disable-app-v2-background-blur": {
				"name": "Disable background blur effects",
				"hint": "Disables the background blur effects in the app v2 and all other UI elements. This can dramatically improve performance, especially on lower-end GPUs and certain operating systems like MacOS."
			},

			"custom-render-scale": {
				"name": "Lighting Effects Render Scale",
				"label": "Configure Render Scale",
				"hint": "Configure the render scale for lighting effects on the canvas. This can improve performance significantly, especially on lower-end GPUs. Visual impact ranges from unnoticeable to very noticeable, depending on the effects layer. Activate \"Reduce resolution of lighting effects\" for this configuration to work.",
				"menu": {
					"title": "Custom Render Scale",
					"label": "Custom Render Scale",
					"description": "Configure individual render scales for different lighting effects. The render scale is a multiplier for the internal resolution of the lighting effects. A value of 100 means 100% render scale, so no change. A value of 50 means the resolution is halved and so on.",
					"confirm": "Confirm",
					"cancel": "Reset",
					"FIELDS": {
						"background": {
							"label": "Background",
							"hint": "Background effects render scale. High visual impact, minimal performance impact. Optimized default is 100%"
						},
						"illumination": {
							"label": "Illumination",
							"hint": "Illumination effects render scale. Very low visual impact, medium performance impact. Optimized default is 40%"
						},
						"coloration": {
							"label": "Coloration",
							"hint": "Coloration effects render scale. Medium to very high visual impact, depending on coloration technique. High performance impact. Optimized default is 100%."
						},
						"darkness": {
							"label": "Darkness",
							"hint": "Darkness effects render scale. Minimal visual impact, minimal performance impact. Optimized default is 50%"
						}
					}
				}
			}
		}
	}
}
