{
	"fvtt-perf-optim": {
		"settings": {
			"optimize-interface-layer-clipping": {
				"name": "コマUIレンダリングのバッチ処理の最適化",
				"hint": "コマUI要素のレンダーバッチングを最適化します。視覚的な劣化は予想されません。コマのバーとエフェクトのキャッシュ設定が顕著な影響を与えるために必要です。"
			},
			"token-bars-caching": {
				"name": "コマのリソースバーをキャッシュ",
				"hint": "コマのリソースバーをテクスチャにキャッシュします。高倍率ズーム時のごくわずかな視覚的劣化が予想されます。"
			},
			"token-effects-caching": {
				"name": "コマの効果をキャッシュ",
				"hint": "コマの効果バーをキャッシュします。高倍率ズーム時のごくわずかな視覚的劣化が予想されます。"
			},
			"precomputed-noise-textures": {
				"name": "ライトアニメーションの最適化",
				"hint": "事前に計算されたFBMノイズテクスチャを利用することで、特定のアニメーションライト（Bewitching Wave、Fairy Light、Ghostly Light、Smoke Patch、Swirling Fog、Vortex）のシェーダを最適化します。視覚的な影響は最小限ですが、特にローエンドGPUではパフォーマンスへの影響が大きくなります。"
			},
			"reduce-lighting-resolution": {
				"name": "ライトエフェクト解像度のスケーリング",
				"hint": "パフォーマンスを向上させるために、ライトエフェクトの内部解像度を下げます。これにより、特に多数のライトや大きな光源を使用する場合、パフォーマンスが劇的に向上します。非常に高いズームレベルや、ヘキサドームのような輪郭が非常にはっきりしたライトエフェクトを除けば、視覚的な影響は最小限です。個々のライトレイヤーのレンダリングスケールは、設定メニューで設定できます。"
			},
			"spritesheet-substitution": {
				"name": "スプライトシートによるテクスチャ置換",
				"hint": "コアとなるSVGアイコンやその他のグラフィック要素を、最適化されたスプライトシートに置き換えます。これにより、地点メモ、ライト、ドアなどの多くのUIアイコンを表示する際のパフォーマンスとリソース使用量を向上させることができます。"
			},
			"spritesheet-substitution-custom": {
				"name": "カスタムスプライトシート",
				"label": "カスタムスプライトシート管理",
				"hint": "カスタムスプライトシートを使用すると、よりコアなアイコンやテクスチャ、たとえばカスタム状態マーカー、コマ画像、タイルなどを置き換えて、パフォーマンスを向上させることができます。",
				"menu": {
					"add": "カスタムスプライトシート追加",
					"spritesheet": "カスタムスプライトシート選択",
					"delete": "カスタムスプライトシート削除",
					"title": "カスタムスプライトシート管理",
					"warn-no-src": "スプライトシートを追加するには、ソースを選択する必要があります。",
					"warn-no-json": "選択するファイルは、有効なpixi.jsスプライトシートJSONファイルでなければなりません。",
					"warn-inalid-asset": "選択したファイルに有効なpixi.jsスプライトシートデータが含まれていません。",
					"warn-init-failed": "Prime Performance: デフォルトアイコンを置換するスプライトシートのロードに失敗しました。スプライトシートの最適化は無効になります。詳細はコンソールで確認してください。",
					"warn-custom-spritesheets-failed": "Prime Performance: カスタムスプライトシートのロードに失敗しました。詳細はコンソールで確認してください。"
				}
			},
			"token-ring-spritesheet-support": {
				"name": "ダイナミックリング・スプライトシートのサポート",
				"hint": "ダイナミックリングを持つコマをスプライトシートテクスチャに置き換えることができます。これは、ダイナミックリングとスプライトシート置換機能を使用してコマのテクスチャを置き換える場合にのみ必要です。"
			},
			"disable-app-v2-background-blur": {
				"name": "背景のぼかしエフェクトを無効化",
				"hint": "ApplicationV2 およびその他のすべてのUI要素の背景ぼかしエフェクトを無効にします。これにより、特に低スペックのGPUやMacOSなどの特定のオペレーティングシステムにおいて、パフォーマンスが大幅に向上します。"
			},

			"custom-render-scale": {
				"name": "ライトエフェクトのレンダリングスケール",
				"label": "レンダリングスケール設定",
				"hint": "キャンバス上のライトエフェクトのレンダリングスケールを設定します。これにより、特に低スペックのGPUでパフォーマンスが大幅に向上する場合があります。視覚的な影響は、エフェクトレイヤーによって、ほとんど気付かない程度から非常に顕著なものまでさまざまです。この設定を有効にするには、「ライトエフェクト解像度のスケーリング」を有効にしてください。",
				"menu": {
					"title": "カスタムレンダリングスケール",
					"label": "カスタムレンダリングスケール",
					"description": "異なるライトエフェクトに対して個別のレンダリングスケールを設定します。レンダリングスケールは、ライトエフェクトの内部解像度の乗数です。値が100の場合はレンダリングスケールが100%となり、変更はありません。値が50の場合は解像度が半分になります。",
					"confirm": "確認",
					"cancel": "リセット",
					"FIELDS": {
						"background": {
							"label": "背景",
							"hint": "背景エフェクトのレンダリングスケールです。視覚的な影響は大きいですが、パフォーマンスへの影響は最小限です。最適化されたデフォルト値は100%です。"
						},
						"illumination": {
							"label": "ライト",
							"hint": "ライトエフェクトのレンダリングスケールです。視覚的な影響はごくわずかで、パフォーマンスへの影響は中程度です。最適化されたデフォルト値は40%です。"
						},
						"coloration": {
							"label": "色合い",
							"hint": "色合いエフェクトのレンダリングスケールです。色付け手法に応じて、中程度から非常に高い視覚的な影響があります。パフォーマンスへの影響が大きいです。最適化されたデフォルト値は100%です。"
						},
						"darkness": {
							"label": "暗闇",
							"hint": "暗闇エフェクトのレンダリングスケールです。視覚的な影響は最小限で、パフォーマンスへの影響も最小限です。最適化されたデフォルト値は50%です。"
						}
					}
				}
			}
		}
	}
}
